<!-- attach-outputs:plan-nodes-prod.txt -->
  <!-- Output: plan-nodes-prod.txt -->
  #### plan-nodes-prod.txt 📖: `test: success, prod: success`

  **Last updated:** Feb 25, 2026, 12:29 PM UTC

  <details><summary>Show Contents</summary>

  ```

  
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.cluster.module.talos-vm["tiles-wk-1"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7221"
      ~ ipv4_addresses                       = [
            # (22 unchanged elements hidden)
            [],
          + [],
        ]
      ~ ipv6_addresses                       = [
            # (22 unchanged elements hidden)
            [
                "fe80::200:ff:fe00:0",
            ],
          + [
              + "fe80::200:ff:fe00:0",
            ],
        ]
      ~ mac_addresses                        = [
            # (22 unchanged elements hidden)
            "00:00:00:00:00:00",
          + "00:00:00:00:00:00",
        ]
        name                                 = "tiles-wk-1"
      ~ network_interface_names              = [
            # (22 unchanged elements hidden)
            "lxc5db857f9cecb",
          + "lxcacb24cdf56a5",
        ]
        tags                                 = []
        # (30 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # proxmox_virtual_environment_container.alloy["nuc-g2p-1"] will be created
  + resource "proxmox_virtual_environment_container" "alloy" {
      + description    = <<-EOT
            Alloy monitoring container for nuc-g2p-1 - collects host metrics and logs via node_exporter (hwmon sensors) and system logs
        EOT
      + id             = (known after apply)
      + ipv4           = (known after apply)
      + ipv6           = (known after apply)
      + node_name      = "nuc-g2p-1"
      + protection     = false
      + start_on_boot  = true
      + started        = true
      + tags           = [
          + "alloy",
          + "monitoring",
        ]
      + template       = false
      + timeout_clone  = 1800
      + timeout_create = 1800
      + timeout_delete = 60
      + timeout_start  = 300
      + timeout_update = 1800
      + unprivileged   = false
      + vm_id          = 200

      + disk {
          + acl               = false
          + datastore_id      = "local-lvm"
          + path_in_datastore = (known after apply)
          + quota             = false
          + replicate         = false
          + size              = 4
        }

      + initialization {
          + hostname = "alloy-nuc-g2p-1"

          + ip_config {
              + ipv4 {
                  + address = "dhcp"
                }
            }
        }

      + mount_point {
          + acl               = false
          + backup            = false
          + path              = "/host"
          + path_in_datastore = (known after apply)
          + quota             = false
          + read_only         = true
          + replicate         = true
          + shared            = false
          + volume            = "/"
        }

      + network_interface {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + mtu         = 0
          + name        = "net0"
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + template_file_id = (known after apply)
          + type             = "ubuntu"
        }
    }

  # proxmox_virtual_environment_container.alloy["nuc-g2p-2"] will be created
  + resource "proxmox_virtual_environment_container" "alloy" {
      + description    = <<-EOT
            Alloy monitoring container for nuc-g2p-2 - collects host metrics and logs via node_exporter (hwmon sensors) and system logs
        EOT
      + id             = (known after apply)
      + ipv4           = (known after apply)
      + ipv6           = (known after apply)
      + node_name      = "nuc-g2p-2"
      + protection     = false
      + start_on_boot  = true
      + started        = true
      + tags           = [
          + "alloy",
          + "monitoring",
        ]
      + template       = false
      + timeout_clone  = 1800
      + timeout_create = 1800
      + timeout_delete = 60
      + timeout_start  = 300
      + timeout_update = 1800
      + unprivileged   = false
      + vm_id          = 200

      + disk {
          + acl               = false
          + datastore_id      = "local-lvm"
          + path_in_datastore = (known after apply)
          + quota             = false
          + replicate         = false
          + size              = 4
        }

      + initialization {
          + hostname = "alloy-nuc-g2p-2"

          + ip_config {
              + ipv4 {
                  + address = "dhcp"
                }
            }
        }

      + mount_point {
          + acl               = false
          + backup            = false
          + path              = "/host"
          + path_in_datastore = (known after apply)
          + quota             = false
          + read_only         = true
          + replicate         = true
          + shared            = false
          + volume            = "/"
        }

      + network_interface {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + mtu         = 0
          + name        = "net0"
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + template_file_id = (known after apply)
          + type             = "ubuntu"
        }
    }

  # proxmox_virtual_environment_container.alloy["nuc-g3p-1"] will be created
  + resource "proxmox_virtual_environment_container" "alloy" {
      + description    = <<-EOT
            Alloy monitoring container for nuc-g3p-1 - collects host metrics and logs via node_exporter (hwmon sensors) and system logs
        EOT
      + id             = (known after apply)
      + ipv4           = (known after apply)
      + ipv6           = (known after apply)
      + node_name      = "nuc-g3p-1"
      + protection     = false
      + start_on_boot  = true
      + started        = true
      + tags           = [
          + "alloy",
          + "monitoring",
        ]
      + template       = false
      + timeout_clone  = 1800
      + timeout_create = 1800
      + timeout_delete = 60
      + timeout_start  = 300
      + timeout_update = 1800
      + unprivileged   = false
      + vm_id          = 200

      + disk {
          + acl               = false
          + datastore_id      = "local-lvm"
          + path_in_datastore = (known after apply)
          + quota             = false
          + replicate         = false
          + size              = 4
        }

      + initialization {
          + hostname = "alloy-nuc-g3p-1"

          + ip_config {
              + ipv4 {
                  + address = "dhcp"
                }
            }
        }

      + mount_point {
          + acl               = false
          + backup            = false
          + path              = "/host"
          + path_in_datastore = (known after apply)
          + quota             = false
          + read_only         = true
          + replicate         = true
          + shared            = false
          + volume            = "/"
        }

      + network_interface {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + mtu         = 0
          + name        = "net0"
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + template_file_id = (known after apply)
          + type             = "ubuntu"
        }
    }

  # proxmox_virtual_environment_container.alloy["nuc-g3p-2"] will be created
  + resource "proxmox_virtual_environment_container" "alloy" {
      + description    = <<-EOT
            Alloy monitoring container for nuc-g3p-2 - collects host metrics and logs via node_exporter (hwmon sensors) and system logs
        EOT
      + id             = (known after apply)
      + ipv4           = (known after apply)
      + ipv6           = (known after apply)
      + node_name      = "nuc-g3p-2"
      + protection     = false
      + start_on_boot  = true
      + started        = true
      + tags           = [
          + "alloy",
          + "monitoring",
        ]
      + template       = false
      + timeout_clone  = 1800
      + timeout_create = 1800
      + timeout_delete = 60
      + timeout_start  = 300
      + timeout_update = 1800
      + unprivileged   = false
      + vm_id          = 200

      + disk {
          + acl               = false
          + datastore_id      = "local-lvm"
          + path_in_datastore = (known after apply)
          + quota             = false
          + replicate         = false
          + size              = 4
        }

      + initialization {
          + hostname = "alloy-nuc-g3p-2"

          + ip_config {
              + ipv4 {
                  + address = "dhcp"
                }
            }
        }

      + mount_point {
          + acl               = false
          + backup            = false
          + path              = "/host"
          + path_in_datastore = (known after apply)
          + quota             = false
          + read_only         = true
          + replicate         = true
          + shared            = false
          + volume            = "/"
        }

      + network_interface {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + mtu         = 0
          + name        = "net0"
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + template_file_id = (known after apply)
          + type             = "ubuntu"
        }
    }

  # proxmox_virtual_environment_file.alloy_config["nuc-g2p-1"] will be created
  + resource "proxmox_virtual_environment_file" "alloy_config" {
      + content_type           = "snippets"
      + datastore_id           = "local"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "nuc-g2p-1"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_raw {
          + data      = <<-EOT
                // Alloy configuration for Proxmox host monitoring
                // Collects node_exporter metrics (including hwmon sensors) and system logs, forwarding to OTLP endpoints
                
                // Node exporter for host system metrics
                // This will collect hwmon metrics (temperature, fan speeds) from /sys/class/hwmon/
                prometheus.exporter.unix "node" {
                  procfs_path = "/host/proc"
                  sysfs_path  = "/host/sys"
                  rootfs_path = "/host"
                }
                
                // OTLP HTTP exporter for tiles-test cluster
                otelcol.exporter.otlphttp "tiles_test" {
                  client {
                    endpoint = "https://otlp.tiles-test.symmatree.com"
                    headers = {
                      "X-Scope-OrgID" = "tiles-test",
                    }
                  }
                }
                
                // OTLP HTTP exporter for tiles cluster
                otelcol.exporter.otlphttp "tiles" {
                  client {
                    endpoint = "https://otlp.tiles.symmatree.com"
                    headers = {
                      "X-Scope-OrgID" = "tiles",
                    }
                  }
                }
                
                // Scrape node exporter metrics (system performance + hwmon sensors) and convert to OTLP format
                prometheus.scrape "node" {
                  // This job_name lets us re-use the node_exporter_mixin dashboards
                  job_name = "integrations/node_exporter"
                  targets    = prometheus.exporter.unix.node.targets
                  forward_to = [otelcol.receiver.prometheus.main.receiver]
                }
                // TODO: Consider dropping metrics and labels like
                // https://github.com/grafana/k8s-monitoring-helm/blob/ea357b0204031a05adc478f4778875c6122b0a98/charts/k8s-monitoring/charts/feature-cluster-metrics/templates/_node_exporter.alloy.tpl
                // which really prunes a lot.
                
                // Convert Prometheus to OTLP
                otelcol.receiver.prometheus "main" {
                  output {
                    metrics = [otelcol.processor.attributes.main.input]
                  }
                }
                
                // Add cluster label to both metrics and logs, forwarding to both clusters
                otelcol.processor.attributes "main" {
                  action {
                    key    = "cluster"
                    value  = "bond"
                    action = "upsert"
                  }
                
                  action {
                    key    = "hostname"
                    value  = "nuc-g2p-1"
                    action = "upsert"
                  }
                
                  output {
                    metrics = [
                      otelcol.exporter.otlphttp.tiles_test.input,
                      otelcol.exporter.otlphttp.tiles.input,
                    ]
                    logs = [
                      otelcol.exporter.otlphttp.tiles_test.input,
                      otelcol.exporter.otlphttp.tiles.input,
                    ]
                  }
                }
                
                // Log collection from host
                // Proxmox uses systemd, so we can collect from journald or traditional syslog
                loki.source.file "syslog" {
                  targets = [
                    {
                      __path__ = "/host/var/log/syslog",
                      job      = "proxmox-syslog",
                      host     = "nuc-g2p-1",
                    },
                    {
                      __path__ = "/host/var/log/messages",
                      job      = "proxmox-messages",
                      host     = "nuc-g2p-1",
                    },
                    {
                      __path__ = "/host/var/log/auth.log",
                      job      = "proxmox-auth",
                      host     = "nuc-g2p-1",
                    },
                    {
                      __path__ = "/host/var/log/daemon.log",
                      job      = "proxmox-daemon",
                      host     = "nuc-g2p-1",
                    },
                  ]
                  forward_to = [otelcol.receiver.loki.main.receiver]
                }
                
                // Convert Loki logs to OTLP
                otelcol.receiver.loki "main" {
                  output {
                    logs = [otelcol.processor.attributes.main.input]
                  }
                }
            EOT
          + file_name = "alloy-proxmox-nuc-g2p-1.alloy"
          + resize    = 0
        }
    }

  # proxmox_virtual_environment_file.alloy_config["nuc-g2p-2"] will be created
  + resource "proxmox_virtual_environment_file" "alloy_config" {
      + content_type           = "snippets"
      + datastore_id           = "local"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "nuc-g2p-2"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_raw {
          + data      = <<-EOT
                // Alloy configuration for Proxmox host monitoring
                // Collects node_exporter metrics (including hwmon sensors) and system logs, forwarding to OTLP endpoints
                
                // Node exporter for host system metrics
                // This will collect hwmon metrics (temperature, fan speeds) from /sys/class/hwmon/
                prometheus.exporter.unix "node" {
                  procfs_path = "/host/proc"
                  sysfs_path  = "/host/sys"
                  rootfs_path = "/host"
                }
                
                // OTLP HTTP exporter for tiles-test cluster
                otelcol.exporter.otlphttp "tiles_test" {
                  client {
                    endpoint = "https://otlp.tiles-test.symmatree.com"
                    headers = {
                      "X-Scope-OrgID" = "tiles-test",
                    }
                  }
                }
                
                // OTLP HTTP exporter for tiles cluster
                otelcol.exporter.otlphttp "tiles" {
                  client {
                    endpoint = "https://otlp.tiles.symmatree.com"
                    headers = {
                      "X-Scope-OrgID" = "tiles",
                    }
                  }
                }
                
                // Scrape node exporter metrics (system performance + hwmon sensors) and convert to OTLP format
                prometheus.scrape "node" {
                  // This job_name lets us re-use the node_exporter_mixin dashboards
                  job_name = "integrations/node_exporter"
                  targets    = prometheus.exporter.unix.node.targets
                  forward_to = [otelcol.receiver.prometheus.main.receiver]
                }
                // TODO: Consider dropping metrics and labels like
                // https://github.com/grafana/k8s-monitoring-helm/blob/ea357b0204031a05adc478f4778875c6122b0a98/charts/k8s-monitoring/charts/feature-cluster-metrics/templates/_node_exporter.alloy.tpl
                // which really prunes a lot.
                
                // Convert Prometheus to OTLP
                otelcol.receiver.prometheus "main" {
                  output {
                    metrics = [otelcol.processor.attributes.main.input]
                  }
                }
                
                // Add cluster label to both metrics and logs, forwarding to both clusters
                otelcol.processor.attributes "main" {
                  action {
                    key    = "cluster"
                    value  = "bond"
                    action = "upsert"
                  }
                
                  action {
                    key    = "hostname"
                    value  = "nuc-g2p-2"
                    action = "upsert"
                  }
                
                  output {
                    metrics = [
                      otelcol.exporter.otlphttp.tiles_test.input,
                      otelcol.exporter.otlphttp.tiles.input,
                    ]
                    logs = [
                      otelcol.exporter.otlphttp.tiles_test.input,
                      otelcol.exporter.otlphttp.tiles.input,
                    ]
                  }
                }
                
                // Log collection from host
                // Proxmox uses systemd, so we can collect from journald or traditional syslog
                loki.source.file "syslog" {
                  targets = [
                    {
                      __path__ = "/host/var/log/syslog",
                      job      = "proxmox-syslog",
                      host     = "nuc-g2p-2",
                    },
                    {
                      __path__ = "/host/var/log/messages",
                      job      = "proxmox-messages",
                      host     = "nuc-g2p-2",
                    },
                    {
                      __path__ = "/host/var/log/auth.log",
                      job      = "proxmox-auth",
                      host     = "nuc-g2p-2",
                    },
                    {
                      __path__ = "/host/var/log/daemon.log",
                      job      = "proxmox-daemon",
                      host     = "nuc-g2p-2",
                    },
                  ]
                  forward_to = [otelcol.receiver.loki.main.receiver]
                }
                
                // Convert Loki logs to OTLP
                otelcol.receiver.loki "main" {
                  output {
                    logs = [otelcol.processor.attributes.main.input]
                  }
                }
            EOT
          + file_name = "alloy-proxmox-nuc-g2p-2.alloy"
          + resize    = 0
        }
    }

  # proxmox_virtual_environment_file.alloy_config["nuc-g3p-1"] will be created
  + resource "proxmox_virtual_environment_file" "alloy_config" {
      + content_type           = "snippets"
      + datastore_id           = "local"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "nuc-g3p-1"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_raw {
          + data      = <<-EOT
                // Alloy configuration for Proxmox host monitoring
                // Collects node_exporter metrics (including hwmon sensors) and system logs, forwarding to OTLP endpoints
                
                // Node exporter for host system metrics
                // This will collect hwmon metrics (temperature, fan speeds) from /sys/class/hwmon/
                prometheus.exporter.unix "node" {
                  procfs_path = "/host/proc"
                  sysfs_path  = "/host/sys"
                  rootfs_path = "/host"
                }
                
                // OTLP HTTP exporter for tiles-test cluster
                otelcol.exporter.otlphttp "tiles_test" {
                  client {
                    endpoint = "https://otlp.tiles-test.symmatree.com"
                    headers = {
                      "X-Scope-OrgID" = "tiles-test",
                    }
                  }
                }
                
                // OTLP HTTP exporter for tiles cluster
                otelcol.exporter.otlphttp "tiles" {
                  client {
                    endpoint = "https://otlp.tiles.symmatree.com"
                    headers = {
                      "X-Scope-OrgID" = "tiles",
                    }
                  }
                }
                
                // Scrape node exporter metrics (system performance + hwmon sensors) and convert to OTLP format
                prometheus.scrape "node" {
                  // This job_name lets us re-use the node_exporter_mixin dashboards
                  job_name = "integrations/node_exporter"
                  targets    = prometheus.exporter.unix.node.targets
                  forward_to = [otelcol.receiver.prometheus.main.receiver]
                }
                // TODO: Consider dropping metrics and labels like
                // https://github.com/grafana/k8s-monitoring-helm/blob/ea357b0204031a05adc478f4778875c6122b0a98/charts/k8s-monitoring/charts/feature-cluster-metrics/templates/_node_exporter.alloy.tpl
                // which really prunes a lot.
                
                // Convert Prometheus to OTLP
                otelcol.receiver.prometheus "main" {
                  output {
                    metrics = [otelcol.processor.attributes.main.input]
                  }
                }
                
                // Add cluster label to both metrics and logs, forwarding to both clusters
                otelcol.processor.attributes "main" {
                  action {
                    key    = "cluster"
                    value  = "bond"
                    action = "upsert"
                  }
                
                  action {
                    key    = "hostname"
                    value  = "nuc-g3p-1"
                    action = "upsert"
                  }
                
                  output {
                    metrics = [
                      otelcol.exporter.otlphttp.tiles_test.input,
                      otelcol.exporter.otlphttp.tiles.input,
                    ]
                    logs = [
                      otelcol.exporter.otlphttp.tiles_test.input,
                      otelcol.exporter.otlphttp.tiles.input,
                    ]
                  }
                }
                
                // Log collection from host
                // Proxmox uses systemd, so we can collect from journald or traditional syslog
                loki.source.file "syslog" {
                  targets = [
                    {
                      __path__ = "/host/var/log/syslog",
                      job      = "proxmox-syslog",
                      host     = "nuc-g3p-1",
                    },
                    {
                      __path__ = "/host/var/log/messages",
                      job      = "proxmox-messages",
                      host     = "nuc-g3p-1",
                    },
                    {
                      __path__ = "/host/var/log/auth.log",
                      job      = "proxmox-auth",
                      host     = "nuc-g3p-1",
                    },
                    {
                      __path__ = "/host/var/log/daemon.log",
                      job      = "proxmox-daemon",
                      host     = "nuc-g3p-1",
                    },
                  ]
                  forward_to = [otelcol.receiver.loki.main.receiver]
                }
                
                // Convert Loki logs to OTLP
                otelcol.receiver.loki "main" {
                  output {
                    logs = [otelcol.processor.attributes.main.input]
                  }
                }
            EOT
          + file_name = "alloy-proxmox-nuc-g3p-1.alloy"
          + resize    = 0
        }
    }

  # proxmox_virtual_environment_file.alloy_config["nuc-g3p-2"] will be created
  + resource "proxmox_virtual_environment_file" "alloy_config" {
      + content_type           = "snippets"
      + datastore_id           = "local"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "nuc-g3p-2"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_raw {
          + data      = <<-EOT
                // Alloy configuration for Proxmox host monitoring
                // Collects node_exporter metrics (including hwmon sensors) and system logs, forwarding to OTLP endpoints
                
                // Node exporter for host system metrics
                // This will collect hwmon metrics (temperature, fan speeds) from /sys/class/hwmon/
                prometheus.exporter.unix "node" {
                  procfs_path = "/host/proc"
                  sysfs_path  = "/host/sys"
                  rootfs_path = "/host"
                }
                
                // OTLP HTTP exporter for tiles-test cluster
                otelcol.exporter.otlphttp "tiles_test" {
                  client {
                    endpoint = "https://otlp.tiles-test.symmatree.com"
                    headers = {
                      "X-Scope-OrgID" = "tiles-test",
                    }
                  }
                }
                
                // OTLP HTTP exporter for tiles cluster
                otelcol.exporter.otlphttp "tiles" {
                  client {
                    endpoint = "https://otlp.tiles.symmatree.com"
                    headers = {
                      "X-Scope-OrgID" = "tiles",
                    }
                  }
                }
                
                // Scrape node exporter metrics (system performance + hwmon sensors) and convert to OTLP format
                prometheus.scrape "node" {
                  // This job_name lets us re-use the node_exporter_mixin dashboards
                  job_name = "integrations/node_exporter"
                  targets    = prometheus.exporter.unix.node.targets
                  forward_to = [otelcol.receiver.prometheus.main.receiver]
                }
                // TODO: Consider dropping metrics and labels like
                // https://github.com/grafana/k8s-monitoring-helm/blob/ea357b0204031a05adc478f4778875c6122b0a98/charts/k8s-monitoring/charts/feature-cluster-metrics/templates/_node_exporter.alloy.tpl
                // which really prunes a lot.
                
                // Convert Prometheus to OTLP
                otelcol.receiver.prometheus "main" {
                  output {
                    metrics = [otelcol.processor.attributes.main.input]
                  }
                }
                
                // Add cluster label to both metrics and logs, forwarding to both clusters
                otelcol.processor.attributes "main" {
                  action {
                    key    = "cluster"
                    value  = "bond"
                    action = "upsert"
                  }
                
                  action {
                    key    = "hostname"
                    value  = "nuc-g3p-2"
                    action = "upsert"
                  }
                
                  output {
                    metrics = [
                      otelcol.exporter.otlphttp.tiles_test.input,
                      otelcol.exporter.otlphttp.tiles.input,
                    ]
                    logs = [
                      otelcol.exporter.otlphttp.tiles_test.input,
                      otelcol.exporter.otlphttp.tiles.input,
                    ]
                  }
                }
                
                // Log collection from host
                // Proxmox uses systemd, so we can collect from journald or traditional syslog
                loki.source.file "syslog" {
                  targets = [
                    {
                      __path__ = "/host/var/log/syslog",
                      job      = "proxmox-syslog",
                      host     = "nuc-g3p-2",
                    },
                    {
                      __path__ = "/host/var/log/messages",
                      job      = "proxmox-messages",
                      host     = "nuc-g3p-2",
                    },
                    {
                      __path__ = "/host/var/log/auth.log",
                      job      = "proxmox-auth",
                      host     = "nuc-g3p-2",
                    },
                    {
                      __path__ = "/host/var/log/daemon.log",
                      job      = "proxmox-daemon",
                      host     = "nuc-g3p-2",
                    },
                  ]
                  forward_to = [otelcol.receiver.loki.main.receiver]
                }
                
                // Convert Loki logs to OTLP
                otelcol.receiver.loki "main" {
                  output {
                    logs = [otelcol.processor.attributes.main.input]
                  }
                }
            EOT
          + file_name = "alloy-proxmox-nuc-g3p-2.alloy"
          + resize    = 0
        }
    }

  # proxmox_virtual_environment_oci_image.alloy["nuc-g2p-1"] will be created
  + resource "proxmox_virtual_environment_oci_image" "alloy" {
      + datastore_id        = "local"
      + file_name           = (known after apply)
      + id                  = (known after apply)
      + node_name           = "nuc-g2p-1"
      + overwrite           = true
      + overwrite_unmanaged = false
      + reference           = "docker.io/grafana/alloy:latest"
      + size                = (known after apply)
      + upload_timeout      = 600
    }

  # proxmox_virtual_environment_oci_image.alloy["nuc-g2p-2"] will be created
  + resource "proxmox_virtual_environment_oci_image" "alloy" {
      + datastore_id        = "local"
      + file_name           = (known after apply)
      + id                  = (known after apply)
      + node_name           = "nuc-g2p-2"
      + overwrite           = true
      + overwrite_unmanaged = false
      + reference           = "docker.io/grafana/alloy:latest"
      + size                = (known after apply)
      + upload_timeout      = 600
    }

  # proxmox_virtual_environment_oci_image.alloy["nuc-g3p-1"] will be created
  + resource "proxmox_virtual_environment_oci_image" "alloy" {
      + datastore_id        = "local"
      + file_name           = (known after apply)
      + id                  = (known after apply)
      + node_name           = "nuc-g3p-1"
      + overwrite           = true
      + overwrite_unmanaged = false
      + reference           = "docker.io/grafana/alloy:latest"
      + size                = (known after apply)
      + upload_timeout      = 600
    }

  # proxmox_virtual_environment_oci_image.alloy["nuc-g3p-2"] will be created
  + resource "proxmox_virtual_environment_oci_image" "alloy" {
      + datastore_id        = "local"
      + file_name           = (known after apply)
      + id                  = (known after apply)
      + node_name           = "nuc-g3p-2"
      + overwrite           = true
      + overwrite_unmanaged = false
      + reference           = "docker.io/grafana/alloy:latest"
      + size                = (known after apply)
      + upload_timeout      = 600
    }

Plan: 12 to add, 0 to change, 0 to destroy.

  ```

  </details>
  
  